src/Catalogs/ВерсииХранилища.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВерсииХранилища</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗД_Хранилища</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_Хранилища</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМетаданных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГитХеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданныхСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭлементКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЭлементКонфигурации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ксВажностьМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Например, "ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Comment>Например, "ПланВидовХарактеристик.ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВерсииХранилища/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру последней версии хранилища
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций -  ссылка на хранилище
// Возвращаемое значение:
// 	Структура - номер последней версии и ссылка на версию
Функция ПоследняяВерсияХранилища(Знач Хранилище) Экспорт 
	
	Результат = Новый Структура("Версия, Ссылка", 0, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Версия КАК Версия,
	|	ЕСТЬNULL(ВерсииХранилища.Ссылка, ЗНАЧЕНИЕ(Справочник.ВерсииХранилища.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(МАКСИМУМ(ВерсииХранилища.Код), 0) КАК Версия
	|	ИЗ
	|		Справочник.ВерсииХранилища КАК ВерсииХранилища
	|	ГДЕ
	|		ВерсииХранилища.Владелец = &Хранилище) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВерсииХранилища КАК ВерсииХранилища
	|		ПО ВложенныйЗапрос.Версия = ВерсииХранилища.Код
	|			И (ВерсииХранилища.Владелец = &Хранилище)";
	
	Запрос.УстановитьПараметр("Хранилище", Хранилище);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Загрузить версию отчета из файла
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - ссылка на хранилище
// 	ИмяФайлаОтчета - Строка - Имя файла отчета
Процедура ЗагрузитьВерсииИзОтчета(Знач Хранилище, ИмяФайлаОтчета) Экспорт 
	
	Файл = Новый Файл(ИмяФайлаОтчета);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Отчет = Новый  ТабличныйДокумент;
	Отчет.Прочитать(ИмяФайлаОтчета);
	
	ВерсииХранилища = Новый Массив;
	
	ПоляВерсии = Новый Соответствие;
	ПоляВерсии.Вставить("Версия:", "Версия");
	ПоляВерсии.Вставить("Дата создания:", "ДатаСоздания");
	ПоляВерсии.Вставить("Время создания:", "ВремяСоздания");
	ПоляВерсии.Вставить("Версия конфигурации:", "ВерсияКонфигурации");   ////<< TODO Danilin.V 5 марта 2025 г. 12:33:27   
	ПоляВерсии.Вставить("Пользователь:", "Пользователь");
	ПоляВерсии.Вставить("Комментарий:", "Комментарий");
	ПоляВерсии.Вставить("Добавлены:", "Добавлены");
	ПоляВерсии.Вставить("Изменены:", "Изменены");
	ПоляВерсии.Вставить("Удалены:", "Удалены");
	ПоляВерсии.Вставить("Version:", "Версия");
	ПоляВерсии.Вставить("Creation date:", "ДатаСоздания");
	ПоляВерсии.Вставить("Creation time:", "ВремяСоздания");
	ПоляВерсии.Вставить("User:", "Пользователь");
	ПоляВерсии.Вставить("Comment:", "Комментарий");
	ПоляВерсии.Вставить("Added:", "Добавлены");
	ПоляВерсии.Вставить("Changed:", "Изменены");
	ПоляВерсии.Вставить("Deleted:", "Удалены");
	
	КолонкаПоиска = Отчет.Область("C1");
	ОбластьСтроки = Неопределено;
	ОбластьСтроки = Отчет.НайтиТекст("Версия:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
	Если ОбластьСтроки = Неопределено Тогда
		ОбластьСтроки = Отчет.НайтиТекст("Version:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
	КонецЕсли;
	Пока ОбластьСтроки <> Неопределено Цикл
		
		ВерсияХранилища = Новый Структура("ВерсияКонфигурации,Версия, ДатаСоздания, ВремяСоздания, Пользователь, Комментарий, Добавлены, Изменены, Удалены", "","", "", "", "", "", Новый Массив, Новый Массив, Новый Массив);
		
		СтрокаНачалаВерсии = ОбластьСтроки.Верх;
		ОбластьСтрокиНаРусском = Отчет.НайтиТекст("Версия:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
		Если ОбластьСтрокиНаРусском = Неопределено Тогда
			ОбластьСтроки = Отчет.НайтиТекст("Version:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
		Иначе
			ОбластьСтроки = ОбластьСтрокиНаРусском;
		КонецЕсли;
		Если ОбластьСтроки = Неопределено Тогда
			
			// Это последняя версия в файле, получаем конец документа
			СтрокаОкончанияВерсии = Отчет.ВысотаТаблицы;
		
		Иначе
		
			СтрокаОкончанияВерсии = ОбластьСтроки.Верх-1;
		
		КонецЕсли; 
		
		ИмяТекущегоМассиваСтрок = "";
		
		Пока СтрокаНачалаВерсии <= СтрокаОкончанияВерсии Цикл
			
			Имя = "R"+Формат(СтрокаНачалаВерсии, "ЧДЦ=; ЧГ=0") + "C1";
			Ключ = ПоляВерсии.Получить(Отчет.Область(Имя).Текст);
			Имя = "R"+Формат(СтрокаНачалаВерсии, "ЧДЦ=; ЧГ=0") + "C2";
			Значение = Отчет.Область(Имя).Текст;
			Если ЗначениеЗаполнено(Значение) Тогда
				Если Ключ = Неопределено Тогда
					
					Если ЗначениеЗаполнено(ИмяТекущегоМассиваСтрок) И ЗначениеЗаполнено(Значение) Тогда
						ВерсияХранилища[ИмяТекущегоМассиваСтрок].Добавить(Значение);
					КонецЕсли; 
				Иначе
					Если ТипЗнч(ВерсияХранилища[Ключ]) = Тип("Массив") Тогда
						ИмяТекущегоМассиваСтрок = Ключ;
						ВерсияХранилища[ИмяТекущегоМассиваСтрок].Добавить(Значение);
					Иначе
						ВерсияХранилища[Ключ] = Значение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			
			СтрокаНачалаВерсии = СтрокаНачалаВерсии + 1;
		
		КонецЦикла; 
		
		ВерсииХранилища.Добавить(ВерсияХранилища);
		
	КонецЦикла;
	
	// Сохраняем версии
	Если ВерсииХранилища.Количество() = 0 Тогда
		Возврат;     
	Иначе
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка версий хранилища конфигурации'", Метаданные.ОсновнойЯзык.КодЯзыка),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.ЗД_Хранилища,
		Хранилище,
		СтрШаблон("Получено: %1 версий",ВерсииХранилища.Количество()));		
	КонецЕсли;
	
	// Если в отчете есть пустые пользователи - не загружаем
	Для Каждого ВерсияХранилища Из ВерсииХранилища Цикл
		Если Не ЗначениеЗаполнено(ВерсияХранилища.Пользователь) Тогда

			ЗаписьЖурналаРегистрации(НСтр("ru = 'Некорректный отчет из хранилища'", Метаданные.ОсновнойЯзык.КодЯзыка), 
			                         УровеньЖурналаРегистрации.Ошибка,
			                         ,
			                         ,
			                         ЗначениеВСтрокуВнутр(Отчет));						
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	//МассивКодов = Новый Массив;
	//Для каждого ВерсияХранилища Из ВерсииХранилища Цикл
	//	Версия = Число(ВерсияХранилища.Версия);
	//	Если Версия = 0 Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	МассивКодов.Добавить(Версия);
	//
	//КонецЦикла;
	//
	//Если МассивКодов.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли; 
	
	ноТаблицаВерсий = Новый ТаблицаЗначений;
	ноТаблицаВерсий.Колонки.Добавить("Код",Новый ОписаниеТипов("Число"));
	ноТаблицаВерсий.Колонки.Добавить("ДатаСоздания",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Для каждого ВерсияХранилища из ВерсииХранилища Цикл
		ВерсияХранилища.Версия = Число(ВерсияХранилища.Версия);		
		Попытка
			ВремяСоздания = СтрЗаменить(ВерсияХранилища.ВремяСоздания, ":", "");
			Если СтрДлина(ВремяСоздания) = 5 Тогда
				ВремяСоздания = "0" + ВремяСоздания;
			КонецЕсли; 
			ВерсияХранилища.ДатаСоздания = Дата(Прав(СокрЛП(ВерсияХранилища.ДатаСоздания), 4) + Сред(ВерсияХранилища.ДатаСоздания,4,2) + Лев(ВерсияХранилища.ДатаСоздания, 2) + ВремяСоздания);
		Исключение
		КонецПопытки;  
		
		НоваяСтрока = ноТаблицаВерсий.Добавить();
		НоваяСтрока.код	=	ВерсияХранилища.Версия;
		НоваяСтрока.ДатаСоздания	=	ВерсияХранилища.ДатаСоздания;
			
	КонецЦикла; 	
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ВерсииХранилища");
		
		////<< Danilin.V 03.03.2025 SD-86203
		//было
		ЭлементБлокировки.УстановитьЗначение("Владелец", Хранилище);
		//Стало
		//ЭлементБлокировки.УстановитьЗначение("ноХранилище", Хранилище);
		//Danilin.V>>
		
		Блокировка.Заблокировать();
		
		//было
		Запрос = Новый Запрос;
		 
		//"ВЫБРАТЬ
		//|	ВерсииХранилища.Ссылка,
		//|	ВерсииХранилища.Код
		//|ИЗ
		//|	Справочник.ВерсииХранилища КАК ВерсииХранилища
		//|ГДЕ
		//|	ВерсииХранилища.Владелец = &Хранилище
		//|	И ВерсииХранилища.Код В(&Коды)";
		//
		//Запрос.УстановитьПараметр("Коды", МассивКодов);
		//Запрос.УстановитьПараметр("Хранилище", Хранилище);   
		
        //Стало
		Запрос.УстановитьПараметр("ВерсииХранилища", ноТаблицаВерсий);
		Запрос.УстановитьПараметр("ноХранилище", Хранилище);   
		
		 Запрос.Текст =
		 "ВЫБРАТЬ
		 |	ВерсииХранилища.Код КАК Код,
		 |	ВерсииХранилища.ДатаСоздания КАК ДатаСоздания
		 |ПОМЕСТИТЬ ТаблицаВерсий
		 |ИЗ
		 |	&ВерсииХранилища КАК ВерсииХранилища
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	СпрВерсииХранилища.Ссылка КАК Ссылка,
		 |	СпрВерсииХранилища.Код КАК Версия,
		 |	СпрВерсииХранилища.ДатаСоздания КАК ДатаСоздания
		 |ИЗ
		 |	Справочник.ВерсииХранилища КАК СпрВерсииХранилища
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВерсий КАК ТаблицаВерсий
		 |		ПО СпрВерсииХранилища.Код = ТаблицаВерсий.Код
		 |			И СпрВерсииХранилища.ДатаСоздания = ТаблицаВерсий.ДатаСоздания
		 |ГДЕ
		 |	СпрВерсииХранилища.Владелец = &ноХранилище";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаВерсий = РезультатЗапроса.Выгрузить();
		ТаблицаВерсий.Индексы.Добавить("Версия");
		ТаблицаВерсий.Индексы.Добавить("ДатаСоздания");  
		
		СтруктураПоиска = Новый Структура("Версия,ДатаСоздания");
		
		Для каждого ВерсияХранилища Из ВерсииХранилища Цикл
			Версия = Число(ВерсияХранилища.Версия);
			Если Версия = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			//НайденнаяСтрока = ТаблицаВерсий.Найти(Версия, "Код");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,ВерсияХранилища);
			МассивСтрок = ТаблицаВерсий.НайтиСтроки(СтруктураПоиска);
			
			
			Если МассивСтрок.Количество() = 0 Тогда
				
				Объект = Справочники.ВерсииХранилища.СоздатьЭлемент();
				
			Иначе //пока просто берем первую 
				
				Объект = МассивСтрок[0].Ссылка.ПолучитьОбъект();
				
			КонецЕсли; 
			
			Объект.владелец  = Хранилище;
			Объект.Код = Версия;
			Объект.ДатаСоздания = ВерсияХранилища.ДатаСоздания;
			Объект.ВерсияКонфигурации = ВерсияХранилища.ВерсияКонфигурации;
			
			//удалил - выше сделано
			//Попытка
			//	ВремяСоздания = СтрЗаменить(ВерсияХранилища.ВремяСоздания, ":", "");
			//	Если СтрДлина(ВремяСоздания) = 5 Тогда
			//		ВремяСоздания = "0" + ВремяСоздания;
			//	КонецЕсли; 
			//	Объект.ДатаСоздания = Дата(Прав(СокрЛП(ВерсияХранилища.ДатаСоздания), 4) + Сред(ВерсияХранилища.ДатаСоздания,4,2) + Лев(ВерсияХранилища.ДатаСоздания, 2) + ВремяСоздания);
			//Исключение
			//	
			//КонецПопытки; 
			
			Объект.Пользователь = ВерсияХранилища.Пользователь;
			Объект.Комментарий  = ВерсияХранилища.Комментарий;
			
			Объект.Состав.Очистить();
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Добавлены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Добавлено";
				НоваяСтрока.ОбъектМетаданныхСтрокой = ОбъектМетаданных;
				
			КонецЦикла;
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Изменены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Изменено";
				НоваяСтрока.ОбъектМетаданныхСтрокой = ОбъектМетаданных;
				
			КонецЦикла;
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Удалены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Удалено";
				НоваяСтрока.ОбъектМетаданныхСтрокой = ОбъектМетаданных;
				
			КонецЦикла;
			Объект.Записать();
			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка версий хранилища конфигурации'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ЗД_Хранилища,
			Хранилище,
			ТекстОшибки);
			
		ВызватьИсключение ТекстОшибки;
	КонецПопытки; 
	
КонецПроцедуры

// Устанавливает новое состояние для версии хранилища
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Ссылка на версию
//   Состояние - ПеречислениеСсылка.СостоянияВерсии - новое состояние версии
Процедура УстановитьСостояние(Знач ВерсияХранилища, Знач Состояние) Экспорт
	
	//Объект = ВерсияХранилища.ПолучитьОбъект();
	//
	//Если Объект <> Неопределено И Объект.Состояние <> Состояние Тогда
	//	Объект.Состояние = Состояние;
	//	Объект.Записать();
	//КонецЕсли;

КонецПроцедуры

//<< Danilin.V 05.03.2025 SD-86203
Процедура ОбработатьВерсии_РазобратьМетаданные(МассивСсылокВерсий) Экспорт
		
	ТаблицаВерсийКонфигураций = ВернутьКонфигурацийПоМассивуВерсий(МассивСсылокВерсий); 
		
	мТаблица = ТаблицаВерсийКонфигураций.Скопировать(,"Конфигурация");
	мТаблица.свернуть("Конфигурация");
	
	КэшМетаданных = ПолучитьКэшМетаданныхПоКонфигурации(мТаблица.выгрузитьКолонку("Конфигурация"));
	КэшОтработанныхСсылок = Новый Массив;	
	СсылкаЭлКонфигурации = Неопределено;
	мВерсияИзмененена = Ложь;
	
	Для каждого ТекВерсии из МассивСсылокВерсий Цикл    
		Если КэшОтработанныхСсылок.Найти(ТекВерсии)<> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок = ТаблицаВерсийКонфигураций.НайтиСтроки(Новый Структура("ВерсияСсылка",ТекВерсии));
		Если МассивСтрок.количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
						
		мСостав = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекВерсии,"Состав").Выгрузить();		
		
		Для каждого ТекСтрока из МассивСтрок Цикл
			СсылкаЭлКонфигурации = ВернутьСсылкуИзКэшаМетаданных(КэшМетаданных,ТекСтрока.Конфигурация,ТекСтрока.ВерсияОбъектМетаданныхСтрокой);			
			Если не ЗначениеЗаполнено(СсылкаЭлКонфигурации) Тогда				
				СсылкаЭлКонфигурации = ВернутьСсылкуНаЭлементКонфигурации(ТекСтрока.Конфигурация,ТекСтрока.ВерсияОбъектМетаданныхСтрокой,КэшМетаданных);
			КонецЕсли;			
			
			Если не ЗначениеЗаполнено(СсылкаЭлКонфигурации) Тогда	
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не создан <%1> в конфигурации <%2>",ТекСтрока.Конфигурация,ТекСтрока.ВерсияОбъектМетаданныхСтрокой));	
				Продолжить;
			КонецЕсли;

			//Расставим в объекте данные
			МассивСтрокТЧ = мСостав.НайтиСтроки(Новый Структура("ОбъектМетаданныхСтрокой",ТекСтрока.ВерсияОбъектМетаданныхСтрокой));
			
			Для каждого ТекСтрокиТЧ из МассивСтрокТЧ Цикл
				Если ТекСтрокиТЧ.ОбъектМетаданных <> СсылкаЭлКонфигурации Тогда
					ТекСтрокиТЧ.ОбъектМетаданных = СсылкаЭлКонфигурации;
					мВерсияИзмененена = Истина;
				КонецЕсли;				
			КонецЦикла;	
			
			СсылкаЭлКонфигурации = Неопределено;			
			КэшОтработанныхСсылок.Добавить(ТекВерсии); //на случай дублирования
			
		КонецЦикла; 
		
		Если мВерсияИзмененена Тогда
			СО = ТекВерсии.ПолучитьОбъект();
			СО.Состав.загрузить(мСостав);
			СО.Записать();                  		
			мВерсияИзмененена = Ложь;		
		КонецЕсли;
		
	КонецЦикла;
		
	
	

КонецПроцедуры //<< Danilin.V 05.03.2025 SD-86203

Функция ВернутьСсылкуИзКэшаМетаданных(Кэш,Конфигурация,ПолноеИмя)
	
	Результат = Неопределено;
	МассивСтрок = Кэш.найтиСтроки(Новый Структура("Конфигурация,ПолноеИмя",Конфигурация,ПолноеИмя));
	Если МассивСтрок.Количество()>0 Тогда
		Результат = МассивСтрок[0].ссылка;
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции


Функция ВернутьСсылкуНаЭлементКонфигурации(Конфигурация,ВерсияОбъектМетаданныхСтрокой,КэшМетаданных)
	
	МассивПути = СтрРазделить(ВерсияОбъектМетаданныхСтрокой,".");
	
	мРодитель = Справочники.ЭлементКонфигурации.ПустаяСсылка();
	мПолноеИмя = "";
	мКлюч = "";
	СсылкаНаЭлементКонфигурации = Неопределено;
	
	Для каждого ТекЭлемента из МассивПути Цикл
		
		мПолноеИмя = ?(ПустаяСтрока(мПолноеИмя),ТекЭлемента,СтрШаблон("%1.%2",мПолноеИмя,ТекЭлемента));	  
		
		СсылкаНаЭлементКонфигурации = ВернутьСсылкуИзКэшаМетаданных(КэшМетаданных,Конфигурация,мПолноеИмя);
		
		Если НЕ ЗначениеЗаполнено(СсылкаНаЭлементКонфигурации) Тогда 									
			
			СО = Справочники.ЭлементКонфигурации.СоздатьЭлемент();	  
			СО.Родитель = мРодитель;
			СО.Имя = ТекЭлемента;
			со.Наименование = ТекЭлемента;
			СО.ПолноеИмя = мПолноеИмя;
			СО.Конфигурация = Конфигурация;
			СО.Записать(); 
			
			НоваяСтрока = КэшМетаданных.Добавить();		
			НоваяСтрока.Конфигурация = Конфигурация;
			НоваяСтрока.ПолноеИмя = мПолноеИмя;
			НоваяСтрока.Ссылка = СО.Ссылка;			
			
			СсылкаНаЭлементКонфигурации = СО.Ссылка;
		КонецЕсли;		
		
		мРодитель = СсылкаНаЭлементКонфигурации;	
		
	КонецЦикла; 
	
	Возврат СсылкаНаЭлементКонфигурации;
	
	
КонецФункции

Функция ВернутьКонфигурацийПоМассивуВерсий(МассивСсылокВерсий) 
	
	КонфигурацииСоответствие = новый Соответствие;	
	МассивКонфигураций = новый массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗД_Хранилища.Конфигурация КАК Конфигурация,
		|	ВерсииХранилищаСостав.Ссылка КАК ВерсияСсылка,
		|	ВерсииХранилищаСостав.ОбъектМетаданныхСтрокой КАК ВерсияОбъектМетаданныхСтрокой
		|ИЗ
		|	Справочник.ВерсииХранилища.Состав КАК ВерсииХранилищаСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗД_Хранилища КАК ЗД_Хранилища
		|		ПО ВерсииХранилищаСостав.Ссылка.Владелец = ЗД_Хранилища.Ссылка
		|ГДЕ
		|	ВерсииХранилищаСостав.Ссылка В(&МассивСсылок)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылокВерсий);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	РезультатЗапроса.Индексы.Добавить("ВерсияСсылка");
	
	Возврат РезультатЗапроса;
    
КонецФункции


Функция  ПолучитьКэшМетаданныхПоКонфигурации(Конфигурация)
	
	КэшМетаданных = Неопределено;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭлементКонфигурации.ПолноеИмя КАК ПолноеИмя,
		|	ЭлементКонфигурации.Ссылка КАК Ссылка,
		|	ЭлементКонфигурации.Конфигурация КАК Конфигурация
		|ИЗ
		|	Справочник.ЭлементКонфигурации КАК ЭлементКонфигурации
		|ГДЕ
		|	ЭлементКонфигурации.Конфигурация В(&Конфигурация)
		|	И НЕ ЭлементКонфигурации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	
	КэшМетаданных = Запрос.Выполнить().Выгрузить();
	КэшМетаданных.Индексы.Добавить("ПолноеИмя,Конфигурация");
	
	
	Возврат КэшМетаданных;
	
КонецФункции


#КонецОбласти

#КонецЕсли
